#ifndef __DTH11_H_
#define __DTH11_H_


#include <reg51.h>
#include "lcd.h"
#include "def.h"

//----------------------------------------------//
//----------------IO口定义区--------------------//
//----------------------------------------------//
sbit  P2_0  = P2^0 ;

//函数定义
void Delay(U16 j);
void  Delay_10us(void);
void  COM(void);
void RH(void);
void Display_Hum_Temp();

//----------------------------------------------//
//----------------定义区--------------------//
//----------------------------------------------//

//U8  outdata[5];  //定义发送的字节数           
//U8  indata[5];


#endif




 