#ifndef __YW51_H_
#define __YW51_H_

#include <reg51.h>
#include "lcd.h"
#include "def.h"

//----------------------------------------------//
//----------------IO口定义区--------------------//
//----------------------------------------------//
//sbit  P2_0  = P2^0 ;//烟雾传感器的 数据输入口 定义
//sbit  LED1  = P2^0 ;//烟雾报警指示灯 端口定义
//sbit  LED3  = P2^2 ;
//sbit  LED4  = P2^3 ;
//sbit  LED5  = P2^4 ;
//sbit  LED6  = P2^5 ;
//sbit  LED7  = P2^6 ;
//sbit  LED8  = P2^7 ;

//----------------------------------------------//
//----------------定义区--------------------//
//----------------------------------------------//

//函数原型定义
//extern void Delay(U16 j);
 void uart_init_yw51(void);
 U16 Display_PM25(void);
 void SendData_yw51(U8 *a);

 #endif